jaenrig-ifx/micropython/ports/psoc6/modules/network/network_ifx_whd.c
        // Populate BSSID buffer
        snprintf(bssid_buf, sizeof(bssid_buf), "%u.%u.%u.%u.%u.%u", result_ptr->BSSID[0], result_ptr->BSSID[1], result_ptr->BSSID[2], result_ptr->BSSID[3], result_ptr->BSSID[4], result_ptr->BSSID[5]);

        // Get the network status : hidden(1) or open(0)
        if (strlen((const char *)result_ptr->SSID) != 0) {
            hidden_status = 0;
        }

        // Get security type as mapped in micropython function description
        get_security_string_and_type(result_ptr, &security_type);

        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(result_ptr->SSID, strlen((const char *)result_ptr->SSID)),
            mp_obj_new_bytes((const byte *)bssid_buf, strlen((const char *)bssid_buf)),
            MP_OBJ_NEW_SMALL_INT(result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(security_type),
            MP_OBJ_NEW_SMALL_INT(hidden_status)
        };
        mp_obj_list_append(scan_list, mp_obj_new_tuple(6, tuple));
        print_scan_result(result_ptr);

    }

    if ((CY_WCM_SCAN_COMPLETE == status)) {
        /* Reset the number of scan results to 0 for the next scan.*/
        num_scan_result = 0;
    }
    return;
}

// Network Initialization function (called from main.c)
void network_ifx_init(void) {
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_config_t wcm_config = { .interface = CY_WCM_INTERFACE_TYPE_STA };

    memset(&scan_filter, 0, sizeof(cy_wcm_scan_filter_t));
    result = cy_wcm_init(&wcm_config);
    if (result != CY_RSLT_SUCCESS) {
        error_handler(result, "Failed to initialize Wi-Fi Connection Manager.\n");
    }
}

// Print after constructor invoked
STATIC void network_ifx_whd_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    // (void)itf;
//     TODO: Implement print with following parameters
//       - link status (requires tcpip stack integration)
//       - get and print ip address
    const char *status_str = "network status unknown. To be implemented in network.status().";

    /*if (status == CYW43_LINK_DOWN) {
        status_str = "down";
    } else if (status == CYW43_LINK_JOIN || status == CYW43_LINK_NOIP) {
        status_str = "join";
    } else if (status == CYW43_LINK_UP) {
        status_str = "up";
    } else if (status == CYW43_LINK_NONET) {
        status_str = "nonet";
    } else if (status == CYW43_LINK_BADAUTH) {
        status_str = "badauth";
    } else {
        status_str = "fail";
    }*/

    mp_printf(print, "<IFX WHD %s %u.%u.%u.%u>",
        status_str,
        0, // netif->ip_addr.addr & 0xff,
        0, // netif->ip_addr.addr >> 8 & 0xff,
        0, // netif->ip_addr.addr >> 16 & 0xff,
        0 // netif->ip_addr.addr >> 24
        );
}

STATIC mp_obj_t network_ifx_whd_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    if (n_args == 0 || mp_obj_get_int(args[0]) == MOD_NETWORK_STA_IF) {
        return MP_OBJ_FROM_PTR(&network_ifx_whd_wl_sta);
    } else {
        return MP_OBJ_FROM_PTR(&network_ifx_whd_wl_ap);
    }
    return mp_const_none;
}

STATIC mp_obj_t network_ifx_whd_send_ethernet(mp_obj_t self_in, mp_obj_t buf_in) {
    network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    whd_buffer_t *whd_buff = (whd_buffer_t *)&buf;
    int ret = whd_network_send_ethernet_data(whd_ifs[self->itf], *whd_buff);
    whd_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(network_ifx_whd_send_ethernet_obj, network_ifx_whd_send_ethernet);

/*******************************************************************************/
// network API

STATIC mp_obj_t network_ifx_whd_deinit(mp_obj_t self_in) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    // uint32_t ret = whd_deinit(itf);
    uint32_t ret = cy_wcm_deinit();
    whd_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_whd_deinit_obj, network_ifx_whd_deinit);

STATIC mp_obj_t network_ifx_whd_active(size_t n_args, const mp_obj_t *args) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    // whd_interface_t itf = *(self->itf);

    if (n_args == 1) {
        return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
    } else {
        if (mp_obj_is_true(args[1])) {
            // whd_wifi_set_up(itf);
            /* Configure the Wi-Fi interface as a Wi-Fi STA (i.e. Client). */
            cy_wcm_config_t wcm_config = { .interface = CY_WCM_INTERFACE_TYPE_STA };
            cy_wcm_init(&wcm_config);

        } else {
            // whd_wifi_set_down(itf);
            cy_wcm_deinit();
        }
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_whd_active_obj, 1, 2, network_ifx_whd_active);

STATIC mp_obj_t network_ifx_whd_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_passive, ARG_ssid, ARG_essid, ARG_bssid, ARG_channels };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_passive, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_essid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channels, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

    const char *band_string[] =
    {
        [CY_WCM_WIFI_BAND_ANY] = "2.4 and 5 GHz",
        [CY_WCM_WIFI_BAND_2_4GHZ] = "2.4 GHz",
        [CY_WCM_WIFI_BAND_5GHZ] = "5 GHz"
    };
    cy_wcm_mac_t scan_for_mac_value = {SCAN_FOR_MAC_ADDRESS};
    cy_rslt_t result = CY_RSLT_SUCCESS;

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

