jaenrig-ifx/micropython/ports/psoc6/modules/network/network_ifx_whd.c
    // Deprecated kwarg
    if (args[ARG_auth].u_int != -1) {
        args[ARG_security] = args[ARG_auth];
    }

    // Extract the SSID.
    mp_buffer_info_t ssid;
    mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid, MP_BUFFER_READ);
    // // TODO: Check length cannot be more than 32 bytes. Limited by whd lib. Validate argument!
    // whd_ssid_t whd_ssid = {
    //     .length = ssid.len
    // };
    memcpy(connect_param.ap_credentials.SSID, ssid.buf, ssid.len);

    // Extract the key, if given.
    mp_buffer_info_t key;
    key.buf = NULL;
    if (args[ARG_key].u_obj != mp_const_none) {
        mp_get_buffer_raise(args[ARG_key].u_obj, &key, MP_BUFFER_READ);
    }
    memcpy(connect_param.ap_credentials.password, key.buf, key.len);

    // // Extract the BSSID, if given.
    // mp_buffer_info_t bssid;
    // bssid.buf = NULL;
    // if (args[ARG_bssid].u_obj != mp_const_none) {
    //     mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid, MP_BUFFER_READ);
    //     whd_mac_t whd_bssid;

    //     // Check if the given bssid matches the interface bssid
    //     uint32_t ret = whd_wifi_get_bssid(itf, &whd_bssid);
    //     whd_assert_raise(ret);

    //     if (bssid.len != 6) {
    //         if (strncmp(bssid.buf, (char *)whd_bssid.octet, 6)) {
    //             mp_raise_ValueError(NULL);
    //         }
    //     }
    // }

    // Extract the security type, if given.
    cy_wcm_security_t auth_type;
    if (args[ARG_security].u_int == -1) {
        if (key.buf == NULL || key.len == 0) {
            auth_type = CY_WCM_SECURITY_OPEN;
        } else {
            auth_type = CY_WCM_SECURITY_WPA2_AES_PSK;
        }
    } else {
        auth_type = args[ARG_security].u_int;
    }
    connect_param.ap_credentials.security = auth_type;

    // // Extract channel, if given.
    // if (args[ARG_channel].u_int == -1) {

    //     uint32_t ret = whd_wifi_set_channel(itf, args[ARG_channel].u_int);
    //     whd_assert_raise(ret);
    // }

    /* Connect to the Wi-Fi AP. */
    for (uint32_t retry_count = 0; retry_count < MAX_WIFI_CONN_RETRIES; retry_count++)
    {
        result = cy_wcm_connect_ap(&connect_param, &ipaddress);

        if (result == CY_RSLT_SUCCESS) {
            printf("\nSuccessfully connected to Wi-Fi network '%s'.\n", connect_param.ap_credentials.SSID);
            return mp_const_none;
        }
        printf("Connection to Wi-Fi network failed with error code 0x%0X. Retrying in %d ms. Retries left: %d\n",
            (int)result, WIFI_CONN_RETRY_INTERVAL_MS, (int)(MAX_WIFI_CONN_RETRIES - retry_count - 1));

    }
    printf("\nExceeded maximum Wi-Fi connection attempts!\n");
    printf("Wi-Fi connection failed after retrying for %d mins\n\n",
        (int)(WIFI_CONN_RETRY_INTERVAL_MS * MAX_WIFI_CONN_RETRIES) / 60000u);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_whd_connect_obj, 1, network_ifx_whd_connect);

STATIC mp_obj_t network_ifx_whd_disconnect(mp_obj_t self_in) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    uint32_t ret = cy_wcm_disconnect_ap();
    whd_assert_raise(ret);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_whd_disconnect_obj, network_ifx_whd_disconnect);

STATIC mp_obj_t network_ifx_whd_isconnected(mp_obj_t self_in) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    return mp_obj_new_bool(cy_wcm_is_connected_to_ap());

}

STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_whd_isconnected_obj, network_ifx_whd_isconnected);

STATIC mp_obj_t network_ifx_whd_ifconfig(size_t n_args, const mp_obj_t *args) {
    network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (n_args == 1) {
        const ip_addr_t *dns = dns_getserver(0);
        cy_wcm_get_ip_addr(self->itf, &ip_address);
        cy_wcm_get_gateway_ip_address(self->itf, &gateway_addr);
        cy_wcm_get_ip_netmask(self->itf, &net_mask_addr);
        mp_obj_t tuple[4] = {
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4))),
            netutils_format_ipv4_addr((uint8_t *)dns, NETUTILS_BIG),
        };
        return mp_obj_new_tuple(4, tuple);
    } else {
        const mp_obj_t *argss = args + 1;
        mp_obj_t *items;
        mp_obj_get_array_fixed_n(argss[0], 4, &items);
        cy_rslt_t res = cy_wcm_set_ap_ip_setting(&ap_ip, items[0], items[1], items[2], CY_WCM_IP_VER_V4);
        ip_addr_t dns;
        netutils_parse_ipv4_addr(items[3], (uint8_t *)&dns, NETUTILS_BIG);
        dns_setserver(0, &dns);
        if (res == CY_RSLT_SUCCESS) {
            mp_printf(&mp_plat_print, "successfully configured");
        }
    }

    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_whd_ifconfig_obj, 1, 2, network_ifx_whd_ifconfig);

STATIC mp_obj_t network_ifx_whd_status(size_t n_args, const mp_obj_t *args) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    // whd_interface_t itf = *(self->itf);

    if (n_args == 1) {
        // no arguments: return link status
        return MP_OBJ_NEW_SMALL_INT(cy_wcm_is_connected_to_ap());
    }

    // one argument: return status based on query parameter
    switch (mp_obj_str_get_qstr(args[1])) {
        case MP_QSTR_stations: {
            // TODO: return list of connected stations to the AP
            // check cyw43 implementation as reference
        }
    }

    mp_raise_ValueError(MP_ERROR_TEXT("unknown status param"));
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_whd_status_obj, 1, 2, network_ifx_whd_status);

static inline uint32_t nw_get_le32(const uint8_t *buf) {
    return buf[0] | buf[1] << 8 | buf[2] << 16 | buf[3] << 24;
}

